{
  "main": {
    "name": "Guru",
    "occupation": "Technical Program Manager",
    "description": "As a Customer-focused Information Technology professional, I collaborate with engineering team, business partners, various other stakeholders to design, define, and deliver high-visibility programs and innovative solutions.",
    "image": "https://guruweb-image-folder.s3.amazonaws.com/resume/profile.jpg",
    "bio": "As a customer-focused Information Technology professional, I collaborate with engineering team, business partners, various other stakeholders to design, define, and deliver high-visibility programs and innovative solutions. Throughout my career, I have managed software projects and programs, banking industry products development, budgets, and teams to increase efficiencies while reducing costs. I partner with team members to develop strategies, define scope, establish infrastructure, specify deliverables, and execute plans. To maintain agility and continuous improvement, I align assignments with individuals' talents and provide coaching, performance feedback, and development opportunities. I've led and developed several software products (UI, API and Backend) at American Express Technologies which are directly used by millions of customers across the world. Quality is a priority for me. By defining measurable matrix, identifying/resolving potential risks, and communicating effectively across functions, I ensure adherence to standards, timelines, and deliverables. I tailor technical reporting and presentations to promote understanding among all audiences, gain buy-in, and ensure sustainable implementation of products and processes.",
    "contactmessage": "Please contact me below",
    "email": "hightechguru.feedback@gmail.com",
    "phone": "754-715-6550",
    "address": {
      "street": "Personal Lane",
      "city": "Fort Lauderdale",
      "state": "Florida",
      "zip": "33327"
    },
    "website": "https://hightechguru.net",
    "resumedownload": "https://s3.amazonaws.com/darcierivest.com/GuruResume.docx",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/kgurumurthybhat",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/kgurumurthybhat",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/guru04",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/kgurumurthybhat",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Over the years, I have worked on multiple technologies and platforms. Below are some highlights of my skills. Please download my resume for up to date information.",
    "education": [
      {
        "school": "Bangalore University KA INDIA",
        "degree": "Bachelors of Engineering",
        "graduated": "September 2002",
        "description": "Completed Bachelors of engineering with Distinction grade. Awarded Scholarship for complete education.",
        "image": "uvce"
      }
    ],
    "work": [
      {
        "company": "Amazon.com  - Seattle, WA, USA.",
        "title": "Technical Program Manager. ",
        "years": "Feb 2020 - present",
        "description": "Just joined, its still day-1. Guru to serve as a Technical Program Manager at Amazon in Seattle, Washington. In this capacity, Mr. Guru will coordinate and manage technical project and program development of large-scale, distributed software applications, systems, platforms, services, or technologies using Object Oriented coding and design (Java, C  , Perl, HTML) throughout the complete software development lifecycle, from design through release. Duties will also include: defining projects, collecting business requirements, and writing functional and technical specifications; driving software development efforts and managing priorities for project/program completion, including software application performance tuning; developing and managing technical projects and products; creating schedules, identifying and communicating risks to stakeholders, defining risk mitigation strategies, and facilitating appropriate software engineering solutions; and managing cross-functional teams and/or third party-vendors for implementation of project/program requirements.",
        "image": "amazon",
        "image2": "blank" 
      },
      {
        "company": "Atos Syntel Ltd. / American Express Technologies - Florida USA.",
        "title": "Senior Technical Program Manager. ",
        "years": "Jun 2015 - Feb 2020",
        "description": "Banking and Financial services Technology domain professional with over 15 years of experience in application development, dealing with Account Payables, Receivables, Reconciliation, Accounting and Balancng controls.  Certified ScrumMaster CSM®, Certified SAFe® Practioner, Natural leader with successful proven track record managing large software systems in Latin America and the United States. Excellent skills in Program Management, People management, business planning, budgeting, forecasting, issues and risk management. Detail oriented, well organized, analytical, results oriented with passion to grow and deliver. Able to effectively work with cross-functional organizations and teams.",
        "image": "amex",
        "image2": "atos" 
      },
      {
        "company": "Tata Consultancy Services Ltd. / American Express Technologies - Florida USA",
        "title": "Technical Leader, Senior Software Engineer.",
        "years": "Jun 2005 - Mar 2015",
        "description": "As Technical Lead I have lead and delivered multiple high impact projects in payments industry performing multi million dollars payments every day across the globe.",
        "image": "amex",
        "image2": "tata" 
      },
      {
        "company": "Owari Precision products / Toyota Techno Park - Bangalore, India.",
        "title": "Quality Assurance Engineer.",
        "years": "Aug 2003 - Jun 2005",
        "description": "I started my career with a Japanese Start up company called Owari Precision Products located within Toyota Motors India,  where I was responsible for Quality Assurance of  high precision products supplied to all Toyota Motor Corporation across globe. Some of the terminology / process used in modern day IT companies are derived from Toyota Production System (TPS).",
        "image": "toyota",
        "image2": "blank" 
      }
    ],
    "skills": [
      {
        "name": "Technical Program Managment",
        "level": "98%"
      },
      {
        "name": "Python, Object Oriented Programming",
        "level": "97%"
      },
      {
        "name": "AWS Cloud computing",
        "level": "90%"
      },
      {
        "name": "ReactJs, JavaScript, Redux",
        "level": "80%"
      },
      {
        "name": "CSS, HTML5/ Jinja2",
        "level": "90%"
      },
      {
        "name": "MongoDB, Amazon Dynamo DB, Oracle, DB2",
        "level": "80%"
      },
      {
        "name": "DevOps, CI/CD, GIT, GITHUB, BitBucket, Jenkin, AWS Amplify",
        "level": "80%"
      },
      {
        "name": "Alexa Skill Development",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "High tech Guru - A learning project for all.",
        "category": "Learning never Ends!",
        "image": "images/portfolio/guru_new_logo.png",
        "url": "https://hightechguru.net"
      },
      {
        "title": "Numbers Guru - a math skill for Alexa",
        "category": "Alexa Skill Development",
        "image": "images/portfolio/alexa1.jpg",
        "url": "https://www.amazon.com/gp/product/B078QTMMLR?ref=cm_sw_tw_r_as_dp_r8kb5okY0U3Jr"
      },
      {
        "title": "Learn Python",
        "category": "Teaching and learning",
        "image": "images/portfolio/python.png",
        "url": "https://hightechguru.net/python/learn"
      },
      {
        "title": "AWS Certification quiz",
        "category": "AWS Cloud",
        "image": "images/portfolio/aws.png",
        "url": "https://hightechguru.net/numbers/aws_quiz"
      },
      {
        "title": "Tricky numbers - Code to solve!",
        "category": "Learning and development",
        "image": "images/portfolio/rubix.gif",
        "url": "https://hightechguru.net/algorithm/algorithm_home"
      },
      {
        "title": "Elementary School Math Worksheet Generator",
        "category": "Teaching and learning",
        "image": "images/portfolio/math.png",
        "url": "https://hightechguru.net/numbers/worksheet_home"
      },
      {
        "title": "Elementary School Live Math Certification program",
        "category": "Teaching and learning",
        "image": "images/portfolio/certificate.png",
        "url": "https://hightechguru.net/numbers/certification_test"
      },
      {
        "title": "Artificial Inteligence - AWS Project",
        "category": "AI ML",
        "image": "images/portfolio/ai_image.jpg",
        "url": "https://hightechguru.net/rekognition/ai_home"
      },
      {
        "title": "Web tools!",
        "category": "Tech Tools",
        "image": "images/portfolio/tools.png",
        "url": "https://hightechguru.net/tools/tools_home"
      },
      {
        "title": "Convert your Smart phone as Point Of Sale machine.",
        "category": "Point of Sale - Financial",
        "image": "images/portfolio/amexpos1.png",
        "url": "https://hightechguru.net/tools/annexpos_home"
      },
      {
        "title": "Search free to use image!.",
        "category": "Image search",
        "image": "https://source.unsplash.com/300x300/?nature",
        "url": "https://hightechguru.net/tools/image_search"
      },
      {
        "title": "Tech Topics!.",
        "category": "Technology",
        "image": "images/portfolio/system_design.png",
        "url": "https://hightechguru.net/tech_blog/"
      },
      {
        "title": "AI Experiment!",
        "category": "Technology",
        "image": "images/portfolio/ai_emoji.png",
        "url": "https://hightechguru.net/rekognition/ai_experiment"
      },
      {
        "title": "Time pass apps!",
        "category": "Technology",
        "image": "images/portfolio/sudoku.png",
        "url": "https://timepass.hightechguru.net/"
      }

    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Guru is one of those rare team members who - besides providing great dedication to all his assignments - also serves as an inspiring mentor for the whole team. Guru has vast and broad technical experience, yes. However I believe his great interpersonal skills and a superb capacity for empathy result in his ability to motivate the team to care about its projects and the project’s success. He took it upon himself to be the go-to person for interacting with the programmer offsite team, and provided tireless effort, positive attitude and respect for others to achieve great results with that team, which included very successful software deliveries, as well as cost-saving and innovative process improvements. A great team member and leader, most definetely",
        "user": "Alberto Antunano - Technical Program Manger American Express Technologies - USA.",
        "image": "alberto"
      },
      {
        "text": "I had the opportunity and privilege to work with Guru several times on many projects and he is a hard worker, he have a great relationship with the colleagues and it's focused on results. He has strong technical skills and he is a solid contributor to the team and the company.",
        "user": "Eduardo Freitas - Project Architect at American Express Technologies - Brazil.",
        "image": "eduardo"
      },
      {
        "text": "I worked with Guru for a complete year in on different projects. He was really a great partner and somebody to learn from as I was giving my first steps as project leader. As you can see at my profile, I don't like to do recommendations as this is something really important to me, and that I don't do for all the people I know. Guru if one of those guys you want in your team. Is respectful (he always wanted to know about my culture and how do we live in Argentina), great partner, excellent teacher and detailed oriented. You can always count with him even in those difficult situations. He has a 'can do' approach that is refreshing under stressful situations.",
        "user": "Lucas Wells - Delivery Manager at IBM Argentina.",
        "image": "lucas"
      },
      {
        "text": "Guru welcomed me to the American Express/TCS IT group. He introduced me to TCS methodologies and lead me in SDLC. He is responsible and detail oriented and can keep track of multiple projects at the same time without losing focus. He is a very accessible and warm person and it was a pleasure working with him.",
        "user": "Maria Soledad Ruiz - CRM Solution Architect at Advanced Software - Argentina.",
        "image": "maria"
      },
      {
        "text": "I have worked with Guru for the past 2 years, and I must say he is a great person to work with. Guru is proactive, result oriented, responsible and technically sound employee and he is always ready to put all his energy and time to get the job done. He definitely helps projects move smoothly and makes sure that whatever project he is working on meets the highest standards. I am sure he has been and will be a great asset for any team.",
        "user": "Barbara Blackaller - TPM at Tata Consultancy Services - Uruguay.",
        "image": "barbara"
      },
      {
        "text": "I had the pleasure to work with Guru during many years in American Express and in several projects . He is a very reliable technologies professional, always committed to the internal customer and never missing any deadline. He had to face many challenges given the short timeline that the Argentina tax authorities gave to implement several changes in the law that impacted the systems . His results were always outstanding.",
        "user": "Roberto Galantai - Senior Tax Manager at American Express - Argentina.",
        "image": "roberto"
      },
      {
        "text": "I had the previlege to work with Guru during 3 years on many projects in American Express. He has a great relationship with all the colleagues and a strong knowledge in projects of different characteristics. He showed to be a great IT professional, always committed with all the aspects involved in the projects and the company itself.",
        "user": "Cynthia Buffone - Product Owner at American Express. - Argentina.",
        "image": "cynthia"
      },
      {
        "text": "I have had the pleasure to work with Guru for the past 4 years and he is a reliable software development lead willing to put all the effort required to meet his commitments and deliver a quality solution. He is detail oriented and a pleasure to deal with.",
        "user": "Rene Delagado - Technical Relationship Manager at American Express Technologies - USA.",
        "image": "rene"
      },
      {
        "text": "Guru is a very solid IT professional who strives to add value to the business. Result oriented, hard worker and someone that you can trust on. He proactively builds trust relationships with customers keeping customer satisfaction as a key goal. He showed those attributes on different projects that works with me in Amex Technologies LACC Team. And the most important, he is a great person.",
        "user": "Juan Eduardo Roche - TPM at American Express Technologies. - Argentina.",
        "image": "juan"
      },
      {
        "text": "I had the privilege of working with Guru as his leader at American Express. He is a Technical Lead in my organization who delivered outstanding results that were recognized across our team members. Guru brought passion, creativity and tought leadership to the team. He led multiples applications across the LAC and is our liaison between our develop center in India and our LAC center. His experience in different country working with Financial and Merchants platforms gives him a very diverse set of skills and experiences.",
        "user": "Nelson Almeida - TPM at American Express Technologies USA.",
        "image": "nelson"
      },
      {
        "text": "I had the opportunity to work with Guru Krishnamurthy for several years in South Florida. He built and maintained a solid relationship with Tata Consultancy Services colleagues and also with American Express employees, both in Technologies and Business areas. He always partnered in a cooperative way with IT colleagues to overcome difficult situations and find the right solutions for our Clients. He has strong technical skills and he is a truly solid contributor to the team!. Thanks!",
        "user": "Emilio Pintos - Engineering Director - American Express Technologies - USA.",
        "image": "emilio"
      },
      {
        "text": "Guru is a very knowledgeable IT professional with great leadership skills.  Always very professional, practicing teamwork at all times.  Guru has the ability to make complex requests look easy due to his attention to details and communication skills.  We currently work together as part of an Agile Scrum team and I really enjoy working with him.",
        "user": "Eidi Claro - Global Business Manager  - American Express Technologies - USA.",
        "image": "eidi"
      },
      {
        "text": "I had the pleasure of working with Guru in his LAC role. He is a tireless worker and is highly goal motivated. He isn't satisfied until he has uncovered the root cause of an issue. He is a fast learner and quickly masters the subject matter. He is a terrific talent and a great asset to any organization.",
        "user": "Silvia Blanco - Regional Director  - American Express Business.",
        "image": "silvia"
      },
      {
        "text": "I have had the opportunity and pleasure of working with Guru on many US and International projects for over 10 years. Guru is a highly committed and experienced Technologies professional. Guru is an SME in payment processes and platforms at Amex and his support is invaluable as it relates to creating solutions and resolving production breakdowns.",
        "user": "Aimee Hayden - Manager Payments Consultant at American Express.",
        "image": "aimee"
      }
    ]
  }
}